# HR Analytics Project

This project analyzes the HR Analytics Employee Attrition dataset.  
We use both **SQL** and **Python (Pandas)** to answer key business questions,  
then visualize insights for the HR department.

In [ ]:
import sqlite3
import pandas as pd
#import Libaries

In [ ]:
df = pd.read_csv('WA_Fn-UseC_-HR-Employee-Attrition.csv') # Read the file

In [ ]:
conn = sqlite3.connect("employees.db")
df.to_sql("employees", conn, if_exists="replace", index=False) #storing data

# SQL Queries questions

##### Q1: How many total employees are there?

In [ ]:
q1 = pd.read_sql_query("SELECT COUNT (*) FROM employees ;",conn)
q1

   COUNT (*)
0       2729

##### Q2: What is the employee count for each department?

In [ ]:
q2 = pd.read_sql_query("SELECT Department, COUNT(Department) FROM employees GROUP BY Department;",conn)
q2

               Department  COUNT(Department)
0         Human Resources               1055
1  Research & Development                961
2                   Sales                446

##### Q3: What is the average monthly income by job role?

In [ ]:
q3 = pd.read_sql_query("SELECT round(AVG(MonthlyIncome),2), jobrole FROM employees GROUP BY Jobrole ;",conn)
q3

   round(AVG(MonthlyIncome),2)                    JobRole
0                      7528.76  Healthcare Representative
1                      4235.75            Human Resources
2                      3237.17      Laboratory Technician
3                     17181.68                    Manager
4                      7295.14     Manufacturing Director
5                     16033.55          Research Director
6                      3239.97         Research Scientist
7                      6924.28            Sales Executive
8                      2626.00       Sales Representative

##### Q4: Who are the top 5 employees by performance rating?

In [ ]:
q4 = pd.read_sql_query("SELECT employeeNumber,Jobrole,Department,MonthlyIncome, performanceRating from employees ORDER BY performanceRating DESC LIMIT 5 ;",conn)
q4

,EmployeeNumber,JobRole,Department,MonthlyIncome,PerformanceRating
0,2,Research Scientist,Research & Development,5130,4
1,10,Laboratory Technician,Research & Development,2670,4
2,11,Laboratory Technician,Research & Development,2693,4
3,12,Manufacturing Director,Research & Development,9526,4
4,27,Sales Representative,Sales,3407,4